app/controllers/api/v1/tasks_controller.rb

            def index
                @tasks = Task.order('created_at DESC');
---
SELECT `tasks`.* FROM `tasks` ORDER BY created_at DESC

            def show
                @tasks = Task.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

            def create
                @tasks = Task.new(tasks_params)
                if @tasks.save
---
INSERT INTO `tasks` (`titulo`, `status`, `descricao`, `created_at`, `updated_at`) VALUES ('criando uma tarefa', 'aberta', 'criar uma nova tarefa usando REST', '2021-05-11 02:13:57.320082', '2021-05-11 02:13:57.320082')

            def destroy
                @tasks = Task.find(params[:id])
                @tasks.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 3 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 3

            def update
                @tasks = Task.find(params[:id])
                if @tasks.update(tasks_params)
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `tasks`.`status` = 'em andamento', `tasks`.`descricao` = 'verificar se funciona a função de atualizar', `tasks`.`updated_at` = '2021-05-11 02:36:05.179628' WHERE `tasks`.`id` = 4